book-liby-test/app/controllers/books_controller.rb

  def index
      @bks = Book.all    #query db ascending order
        flash[:notice] = "We have exactly #{@bks.size} books available."
---
SELECT `books`.* FROM `books` ORDER BY position ASC
SELECT COUNT(*) FROM `books`

  def show
    @bks = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

  def create
    #new object for passing in
    @bks = Book.new(book_params)
    flash[:notice] = "Alert message!"
    #save the object
    if @bks.save
---
INSERT INTO "books" ("title", "author", "genre", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "11"], ["author", "2"], ["genre", "3"], ["price", 4], ["published_date", "2"], ["created_at", "2020-09-16 17:28:44.186495"], ["updated_at", "2020-09-16 17:28:44.186495"]]

  def edit
    @bks = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1

  def update
    @bks = Book.find(params[:id])
    if @bks.update(book_params)
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 22 LIMIT 1
UPDATE `books` SET `books`.`title` = 'test213123', `books`.`updated_at` = '2020-09-11 14:23:53.783800' WHERE `books`.`id` = 3

  def delete
    @bks = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @bks = Book.find(params[:id])
    @bks.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]